In [1]:
import pandas as pd

In [2]:
data = [[1,2,3], [4,5,6], [7,8,9]]

In [4]:
data

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [5]:
list('321')

['3', '2', '1']

In [6]:
df = pd.DataFrame(data, list('321'), list('ZXY'))

In [7]:
df

   Z  X  Y
3  1  2  3
2  4  5  6
1  7  8  9

In [8]:
df.sort_index(inplace=True)

In [9]:
df

   Z  X  Y
1  7  8  9
2  4  5  6
3  1  2  3

In [10]:
df.sort_index(inplace=True, axis = 1)

In [11]:
df

   X  Y  Z
1  8  9  7
2  5  6  4
3  2  3  1

In [12]:
df.sort_values(by = "X", inplace = True)

In [13]:
df

   X  Y  Z
3  2  3  1
2  5  6  4
1  8  9  7

In [16]:
df.sort_values(by = "3", axis=1, inplace = True)

In [17]:
df

   Z  X  Y
3  1  2  3
2  4  5  6
1  7  8  9